{
    "posts": [{
            "title": "Account Representative",
            "category": "business",
            "education": "College",
            "description": "$60,000 a year – Commission Via Trading is one of the leading wholesale liquidators offering a wide range of overstock and customer return merchandise from the nations leading Department Stores & eCommerce retailers. Recognized by both the Inc 5000 & the LA Business Journal as one of the fastest growing US companies for 8 & 7 consecutive years (2007-2014) Via Trading is a growing company looking to add to our team. We operate with a long term focus and seek to develop high quality relationships with our customers, suppliers and team members. We strive to exceed their expectations and are committed to continuous improvement. Via Trading utilizes a consultative selling approach and is dedicated to the principles of cost effectiveness, teamwork, responsibility and world class service.The company is a private, family owned business founded in 2002 with its headquarters in Lynwood, CA. Operating on a global scale and based in a 240,000 sq.ft warehouse, Via Trading utilizes its scale and expertise to create a one stop shopping experience to fulfill customer surplus merchandise needs. Drive and lead sales growth by building a network of long term, repeat customers. The Account Manager will be a member of the Sales Team with the core responsibility of servicing and developing our customers in order to ensure long term, repeat business. College Degree Required."
        },
        {
            "title": "Business Advertiser1",
            "category": "Business",
            "education": "College",
            "description": " The Advertising Account Manager will be responsible for supporting the Ad Operations group and our OEM clients in executing and monitoring the online advertising programs of Edmunds.com. This individual will work with designated Edmunds.com Account Directors (Sales Representatives) to ensure flawless campaign planning, execution, billing, and reporting as well as provide optimal client service support. The Account Manager will serve as the primary point of contact for client inquiries and requests pertaining to site advertising. Coordinate all operational efforts for post launch campaign management activities inclusive of creative collection, template development, contract entry and order fulfillment. Communicate and deliver ad specifications to Media contact at Agency. Validate all creative submissions adhere to Edmunds.com Advertising specifications and are strictly enforced. Monitor and Analyze campaign performance, delivery, and pacing. Develop optimization strategies to increase and improve Edmunds.com advertising product delivery and performance. Audit, isolate, communicate and resolve any advertising counting discrepancies. Communicate cross functionally with client and internal departments to ensure timely launch of campaigns. Finalize and accurately report monthly billing to Finance via ad operations system. Accuracy is of utmost importance since mistakes have a direct impact to our revenue. Focus and relentless attention to detail are critical to the success of this position. Looking for a candidate that does whatever it takes to get the job done and has a strong sense of urgency and good work ethics. We have tight timelines to activate orders and every day loss has an implication to revenue. Must be able to work in a high pressure environment with tight deadlines. 2-4 years work experience in online advertising, project management, or a production/coordinator type of position. Preferred candidates will have knowledge of DFP, Operative and an overall understanding of online advertising (metrics, serving solutions, etc.), and a basic understanding of accounting/billing a plus. Experience with Excel, Word and PowerPoint a must. Operations focused with direct experience in the Internet and/or Advertising industries. Excellent communication skills and able to deal with multiple internal and external departments. Extremely detail oriented and thrives in a fast-paced deadlines oriented environment. Ability to manage several tasks at once. Able to work independently, generate new campaign and product ideas, understand the business process and work in a team environment."
        },
        {
            "title": "Brand Ambassador1",
            "category": "Business",
            "education": "Masters",
            "description": " Support Brand and City Managers, including execution of main strategies and testing of one off or experimental strategies. Provide account activation support to ensure cambassadors are delighted with Markett’s service. Assist with development of City growth plan. Provide ongoing communication with Support & ops teams on QA, Sales, Marketter inquiries, etc. Participate in and document discussions and action plans during client meetings and conference calls.Skills and Experience,Detail oriented with excellent organizational skills. Strong work ethic and drive to succeed. Flexible to evolve as our business grows and scales. Experienced and familiar with Google Suite, IOS, MS Excel & Powerpoint. Impeccable eye for branding. Maintain a laid-back yet professional conduct within and outside the office while conducting client relations. All hands on deck mentality. We are a startup there will inevitably be other duties not outlined on here that arise. Ideal candidate will have 1+ years experience in Sales, Marketing, Operations, or Account Management role. Must have college degree of equivalent education. Real Estate and/or Airbnb Hosting Experience a plus. Join like-minded individuals who are passionate and energized about expanding the sharing economy & changing the future of work! Competitive salary + uncapped commission.Masters required."
        },
        {
            "title": "Insurance Sales Associtate",
            "category": "Business",
            "education": "College",
            "description": " We are an independent insurance agency located in Santa Monica. We have an opening for a Personal Lines Customer Service Representative. The ideal candidate must have a current P&C Insurance License. Additionally they must be a team player, self starter and be service oriented. They must also possess the following qualifications:Active CA P&C license – REQUIRED. Customer service and sales focused. Must be proficient in Mercury Personal Insurance programs/guidelines. Prioritize and complete work as needed with little supervision. Dedicated to quality and providing service at a high level. Have superior organizational skills. Handle multiple tasks and projects and work within deadlines. Excellent verbal and written communication skills. Be comfortable in a paperless environment. Familiar with carrier products and web sites is preferred. Experience with Sagitta -- a plus. Managing assigned accounts in a timely, professional manner. Maintaining agency management system with up to date information. Following agency procedures and guidelines. Knowledge/ability to work on complex accounts. Minimum 2 years in personal lines as a customer service representative or account manager required. Knowledge of Mercury Insurance website, guidelines and requirements a plus! If you do not have an active, current CA P&C license -- DO NOT APPLY."
        },
        {
            "title": "Account Manager9",
            "category": "Business",
            "education": "college",
            "description": " The Account Manager is a Full-Time Position within the Sales division of Blueprint Studios and is responsible for the creation of pricing proposals, style guides and contract documents that allow new engagements with the company to be effectively produced. You will also have responsibility for the production elements of all projects sold including the management of all product and service procurement whether resources are internal or external. You will be responsible for assuring a positive on-going client relationship maintained in a professional manner. This is a key role within the company and requires the utmost professionalism at all times while representing the company.At Minimum Duties & Responsibilities. Possesses a comprehensive knowledge of Blueprint Studios' full complement of design services.  Ultimately have a full understanding of our Studio Collection inventory and pricing. Gains a comprehensive knowledge of Blueprint Studios production services, printing capabilities, as well as our floral services capabilities. Strategically utilizes our industry partner relationships and sub-vendor programs in the design and production of events. Trains and becomes proficient in the usage of our internal rental software and database management systems. Trains and becomes proficient in the usage of our customer relationship management systems (CRM). Maintains and manages an accurate client profile and database. Ensures the ongoing creation of new lead generation that will allow you to engage new clients. Partners with marketing to maintain and grow established clients. Prepares and gathers client intake documents that will lead to the creation of a written client proposal using descriptive text, imagery or graphic designs when appropriate. Creates itemized project budgets and schedules that ensure project profitability, as well as all contract documents for client agreement. Responsible for individual client program file management and initiating internal workflows. Assists in the accurate management of all client invoicing and billings. Maintains a dialogue with your clients that provide for event post-mortem. Continued knowledge gathering on industry and design trends as related to the performance of your role. Involvement within industry related professional organizations is highly encouraged. The ability to prospect inactive accounts and new business. Respond to inside sales inquiries as required to increase revenue. Other duties as assigned. Work Environment/ Physical Demands. The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to ensure individuals with disabilities to perform the crucial functions. While performing the duties of this job, the employee is frequently required to sit, talk and hear. The employee is required to stand, walk, and use hands to finger, handle, feel, reach with hands and arms, stoop, kneel, crouch, climb or crawl. The employee may need to lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision. The noise level in the work environment is usually moderate to heavy. The temperature will vary from hot to cold depending on the weather.  QUALIFICATIONS. At Minimum Training, Education & Experience. Minimum of five (5) years of outside sales experience within one of the fields of event planning and production, catering services, hotel sales/catering services, trade show exhibit design and production services or similar agency services and production. A proven track record of reaching sales targets within a high volume organization while also showing increased sales revenue year over year. A deep and thorough working knowledge of salesforce and will understand the sales process flow of a project based business environment. Must be self-motivated and have a keen understanding of how to hunt for and win new clients within the core target markets of our business. Ability to maintain an established client base accounts that will need to continue to be serviced while ensuring you are cultivating a relationship that allows you to secure business within that client's portfolio that is not currently with Blueprint Studios."
        },
        {
            "title": "Customer Service8",
            "category": "Business",
            "education": "high school",
            "description": " Do you enjoy working with Customers? We are looking for highly personable and detailed oriented people to work in our Service Centers to keep us growing! Must have at least 1 to 2 years of experience in an interactive Customer Service role. ESSENTIAL DUTIES AND RESPONSIBILITIES (Other duties may be assigned.) Maintain relationships with Customers by providing fast and accurate information regarding the services we provide and current job orders. You will be the go to person for Customer calls. Dispatch our Service Technicians; this involves scheduling, monitoring the dispatch board and calling the Customer with status and job information. Maintain constant contact with our vendors to provide accurate job updates to our Customers. Open and maintain Customer accounts in company database; computer skills are a must. Manage account receivables (collections); our office team both sell jobs and collect any outstanding invoices. Order material from our vendors and log all received material; attention to detail is important to ensure that the correct material is sent to our Customers. JOB REQUIREMENTS. Previous experience working with computer and databases. Possess strong Customer communication and relationship skill; this is a Customer interactive role! A high level of motivation and pride in your work with the ability to work at a sustained pace. Must be detail oriented. Each day is different and each job brings new challenges, you will be required to think on your feet and adapt to any given situation. Capacity to work both in a team environment as well as independently. shifts are available between Vortex business hours of 7:00 AM - 5:30 PM; Monday through Friday. Vortex is unique in the fact that your growth and success are limited only by YOU. The statement you get out of it what you put into it is a cornerstone of your career at Vortex.Career advancement positions are available to individuals who show a high level of consistent performance due to the continuous expansion of Vortex.This may lead to opportunities to grow into management or training roles as we only promote from within the company.High School Diploma."
        },
        {
            "title": "Party Assistant7",
            "category": "childcare",
            "education": "high school",
            "description": " Popular Playcenter Seeking Birthday Party assistants and Open Play reps (near SF Valley).PEEKABOO PLAYLAND is looking for new members to join our great team in a fun and creative environment! Duties may include. customer service. leaning and organizing. serving of food.-co-hosting children's birthday parties. ringing up sales. setting up party tables. engaging kids in games."
        },
        {
            "title": "Account Manager6",
            "category": "Business",
            "education": "College",
            "description": " Operating as the lead point of contact for any and all matters specific to your customers.Building and maintaining strong, long-lasting customer relationships.Overseeing customer account management, including negotiating contracts and agreements to maximize profit. We are looking for a passionate Account manager who will partner with our customers and ensure their long-term success. The Account manager role is to manage a portfolio of assigned customers, develop new business from existing clients and actively seek new opportunities. Account management responsibilities include developing strong relationships with customers, connecting with key business executives and stakeholders and preparing sales reports. Accounts managers will liaise between customers and cross-functional internal teams, ensure the timely and successful delivery of our solutions according to customer needs and improve the entire customer experience. Our ideal candidate is able to identify customer needs and exceed client expectations.Ultimately, a successful Account manager should collaborate with our sales team to achieve sales quotas and grow our business.Job brief.We are looking for a passionate Account manager who will partner with our customers and ensure their long-term success. The Account manager role is to manage a portfolio of assigned customers, develop new business from existing clients and actively seek new opportunities."
        }, {
            "title": "Lead Carpenter5",
            "category": "Construction",
            "education": "Highschool",
            "description": " Account management responsibilities include developing strong relationships with customers, connecting with key business executives and stakeholders and preparing sales reports. Accounts managers will liaise between customers and cross-functional internal teams, ensure the timely and successful delivery of our solutions according to customer needs and improve the entire customer experience. Our ideal candidate is able to identify customer needs and exceed client expectations.Ultimately, a successful Account manager should collaborate with our sales team to achieve sales quotas and grow our business.Responsibilities. Operate as the lead point of contact for any and all matters specific to customer account management.Build and maintain strong, long-lasting customer relationships.Negotiate contracts and close agreements to maximize profit.Develop a trusted advisor relationship with key accounts, customer stakeholders and executive sponsors.Ensure the timely and successful delivery of our solutions according to customer needs and objectives. Communicate clearly the progress of monthly/quarterly initiatives to internal and external stakeholders.Develop new business with existing clients and/or identify areas of improvement to exceed sales quotas.Forecast and track key account metrics (e.g. quarterly sales results and annual forecasts).Prepare reports on account status.Identify and grow opportunities within territory and collaborate with sales teams to ensure growth attainment.Assist with high severity requests or issue escalations as needed .Requirements.Proven work experience as an account manager, key account manager, junior account manager or other relevant experience.Demonstrable ability to communicate, present and influence credibly and effectively at all levels of the organization, including executive and C-level.Solid experience with CRM software and MS Office (particularly MS Excel).Experience in delivering client-focused solutions based on customer needs.Proven ability to manage multiple account management projects at a time while paying strict attention to detail.Excellent listening, negotiation and presentation skills.Excellent verbal and written communications skills.BA/BS degree in Business Administration, Sales or relevant field.Responsible for dedicating a large portion of time and servicing one or more accounts at an agency. Works for an agency with a client and ensure correct information passed from the client to the agency."
        }, {
            "title": "Business Analyst4",
            "category": "Business",
            "education": "College",
            "description": " Handle all client contact. Oversee and review Junior & Assistant bookkeepers  work. Process quarterly financial statements. Review monthly cash flows. Update brokerage statements monthly. Process and review quarterly guild reports. Process quarterly and year end payroll reports. Process payroll for all clients. Review weekly cash receipts and disbursements. Communicate to the partners of the activities on the clients. Communicate with the managers for investments. Prepare city business tax, sales tax return and property tax reports censuses. Please submit resume and salary requirements to resume@tmgjcpa.com or Fax (310) 475-7641."
        }, {
            "title": "Account Manager3",
            "category": "Business",
            "education": "College",
            "description": "Today, TMGJ's client roster includes some of the top names in entertainment, sports and business. And our services have expanded beyond traditional tax and accounting to include business management, business consulting, investment and financial planning. Many of our partners and senior staff members hold advance degrees in taxation and business administration. Our professional staff is comprised entirely of CPAs or CPA Candidates who keep abreast of all federal and state tax law changes, including pending and proposed legislation. Our Firm's reputation attracts top talent who continually enhance their knowledge with education and training that far exceeds their professional requirements.Digital marketing agency is seeking an SEM assistant to become part of our team. You will be working primarily with AdWords and Bing Ads, with possible crossover into Social. Responsibilities will include:- Keyword research - Competitor research- Campaign buildout- Ad Copy experiments - Ongoing optimization - Some involvement with landing page A / B tests.We are a growing team and are looking for an individual who wants to learn and grow with us. Requirements: -AdWords Certified - 1 + years of active AdWords experience - Taking pride in your work "
        }, {
            "title": "Account Manager2",
            "category": "Business",
            "education": "College",
            "description": " SK+G is looking for an experienced Account Manager to manage the day-to-day marketing and communications campaigns for a variety of accounts in our Direct Marketing Division.Manage and coordinate all digital, mobile, and print campaigns while facilitating client approvals, tracking budgets, and ensuring each campaign is executed per the overall campaign strategy by the agreed-upon deadline.The ideal candidate will have 2-4 years of experience in advertising handling a wide range of projects with a high degree of independence and sound judgment. It is necessary for the Account Manager to create long-lasting, strong relationships with our clients while demonstrating strategic insights into our client's work.This individual must understand how to develop plans, counsel clients and implement campaigns using a variety of marketing tools. This is an excellent opportunity for dynamic individuals to advance their careers in advertising by working in an environment dedicated to learning and professional development.Essential responsibilities for the Integrated Account Manager position include:Interfacing with other departments and team members efficiently - our culture is an important part of our work Operates with  a high degree of independence, but knows when to rely on own judgment and when to seek advice of supervisor and other team members Opening jobs accurately and on time using SK+G's agency management software Integrated Account Manager will be trained and required to have a thorough understanding of our software offering, Neuton/EngageIT XMedia and the knowledge to articulate platform strategy, objectives, KPIs, and relevant results Keeping organized files for correspondence, work orders, change orders and creative Presents new ideas/opportunities in order to grow the client's business.Must be able to analyze client situations and apply strategic marketing ideas and implementation plans to meet challenges Develop and implement workflow and processes that ensure effective communication and collaboration between team members and clients Leading discussions, setting clear expectations for deliverables, and communicating them clearly to all team members Keep an up - to - date understanding of the customer and competitive insights 2 - 4 Years prior agency experience or in advertising / marketing field Prior digital experience a must Bachelor 's degree (business, marketing, or advertising) preferred This position is responsible for managing the day to day office related tasks for the company. The position reports directly to the operations manager, but will also need to work closely with the Quality Control Supervisor to manage logistics, communicate production scheduling and promote efficiency through policies and procedures. Overall Responsibilities and Key Accountabilities: Managing logistics. Includes weighing trucks and completing bills of lading and customs paperwork when applicable. Position entails working with cloud-based database software, Microsoft Office and Quickbooks. Facilitating compliance with mining/manufacturing and related regulatory agencies. Managing the companys human resource needs.Assisting in the calculation and processing of payroll. Communication with Operations Manager and Quality Control Supervisor with regards to production and labor scheduling. Getting shipping quotes and coordinating sale orders and purchase orders with customers Management and tracking of petty cash through Quickbooks.Managing bank balance, doing bank reconciliation, tracking payables and receivables for reporting to Operations Manager.Firm grasp on accounting concepts and ability to set up and maintain accounts.Ability to work in Quickbooks to produce profit and loss statements, balance sheets, budgets, and other reports.Act as company liaison answering phone and assisting with paperwork.Assist Operations Manager with setting and monitoring of budgets general administrative tasks. Assisting with the processing and shipment of samples to the post office in Pahrump, NV.Answer general computing and network questions from less experienced team members.Assist Operations Manager with organizing paperwork on special projects."
        }, {
            "title": "Account Manager1",
            "category": "Construction",
            "education": "Highschool",
            "description": " InMotion Hosting one of the nation's fastest-growing web hosting companies, having achieved exceptional performance and growth for many years. Due to our previous success and future growth plans, we're expanding the affiliate team in our Marketing department. We're looking for someone with experienced success in affiliate marketing through growth of sales, development and/or expansion of affiliate programs, and the building of strong affiliate relationships - is that you? If you stay ahead of the curve when it comes to affiliate and industry trends and you're seeking a challenging opportunity you've found your dream job! In this individual contributor role, you will be responsible for aggressively expanding and managing the company's referral partner (affiliate) sales channels and growing the sales results of the affiliate program. You will be a senior member of the Marketing team managing current relationships and fostering new connections with affiliate partners. If you can work effectively in an independent environment, thrive in setting and hitting targets, are assertive, and can keep up with the fast pace of this industry, then keep reading. For top candidates, we will consider remote employment options.  Grow new account sales by developing new affiliate referral/partner channels. Examples of affiliate partners include: Web Hosting Shopper Channels (e.g. Top 10 List Affiliate Websites), Web Hosting User Channels (e.g. Website Template Websites) and Web Hosting Influencer Channels (e.g. Web Design Firms).  Maximize sales volume from existing referral/partner channels. Negotiate financial details regarding referral partnerships(e.g.CPA, paid placement, etc.). Track and report key performance indicators(KPIs) associated with partner channels(e.g.sales volume, overall affiliate share of voice conversion performance, etc) 3 - 5 years of full - time professional experience in Web - based Marketing or Business Development .1 - 3 years of experience with online affiliate program management.BA or equivalent in Marketing, Advertising or Business related coursework.Experience building and managing professional relationships."
        }
    ]
}
